cfd-simulation/trout/U_0p4/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1.0;

vertices
(
    (-2 -1 -1)
    ( 4 -1 -1)
    ( 4  1 -1)
    (-2  1 -1)
    (-2 -1  1)
    ( 4 -1  1)
    ( 4  1  1)
    (-2  1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    bottom
    {
        type symmetry;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }

    sideMin
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
        );
    }

    sideMax
    {
        type symmetry;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);
